{"meta":{"title":"ASTOUND Initiative","subtitle":"Dedicated to encouraging new business models for Ontario creative content entrepreneurs","description":"Led by CFC Media Lab in partnership with Hot Docs, and OCADU. ASTOUND is made possible through The Entertainment and Creative Cluster Partnerships Fund administered by the Ontario Media Development Corporation (OMDC) on behalf of the Ministry of Tourism, Culture, and Sport.","author":"John Ko","url":"http://www.astoundinitiative.ca"},"pages":[{"title":"404 File not found","date":"2016-06-16T02:24:10.000Z","updated":"2016-06-16T01:42:07.000Z","comments":true,"path":"404.html","permalink":"http://www.astoundinitiative.ca/404.html","excerpt":"","text":"404 File not foundSorry, I can’t find the page you’re looking for — Webmaster"},{"title":"Home","date":"2016-06-16T01:23:59.000Z","updated":"2016-06-16T01:25:07.000Z","comments":true,"path":"index.html","permalink":"http://www.astoundinitiative.ca/index.html","excerpt":"","text":"Encouraging private investment in Ontario&#8217;s creative content-based businessesInteractive hands-on training, tools and techniques tailored for creative content producers to realize their business modelsA collaborative environment for knowledge exchange, networking and capacity building between investors and content producersAn innovative forum exploring audience engagement strategies to better leverage financing options for creative content‹›For Content ProducersThe ASTOUND Initiative is dedicated to encouraging new business models for Ontario creative content entrepreneurs working in digital media, film, television, gaming, transmedia, music and publishing.For Content InvestorsASTOUND is addressing investor needs by building relationships and networking opportunities between content producers and investors, as well as creating knowledge exchange and tool kits that provide a deeper understanding of the potential and vitality of the content space."},{"title":"About","date":"2016-06-15T22:53:28.000Z","updated":"2016-06-16T00:49:36.000Z","comments":true,"path":"about/index.html","permalink":"http://www.astoundinitiative.ca/about/index.html","excerpt":"","text":"↑↓About ASTOUND. Innovation + creativity.“If we all did the things we are capable of doing, we would literally, astound ourselves.” — Thomas EdisonThe ASTOUND Initiative recognizes that the burgeoning need for private/pubic sector investment in the creative industries is resulting in a number of solutions in the marketplace from the creation of public/private sector investment funds to the development of Ontario-grown crowd-funding technologies. But in keeping with the inventive nature of Thomas Edison, we believe that innovation and creativity are key to developing a more wholistic and integrated solution that a fund alone, or a technology alone cannot answer.Through the ASTOUND Initiative, we are applying novel solutions from other sectors, with a consultative, co-creative approach with the creative industries community and looking at this solution as an iterative design process.ASTOUND is a year-long phased, systematic initiative that seeks to encourage private investment in Ontario’s creative industries. Phase one includes professional intensives and research in business modeling, and audience engagement, and an event framework that introduces private investors with content creators and companies.↑↓Background. A brief history.For the past year, CFC Media Lab either by itself or with partners such as docShift and HotDocs has been running Business Model Design workshops for digital media content businesses and documentary production companies. For the most part, these workshops have been highly successful and resulted in several of the producers changing their development process to include business model design.But more importantly, through these prototypical workshops we have learned that the Business Model Canvas, though easy to understand for most product-based businesses, required some more detailed explaining and even perhaps a “translation” of sorts for content-based businesses. We have also discovered that more case study examples of successful, and diverse sets of business models for content-based businesses are needed to help support uptake of this design process in this industry.As a means of bridging the gap the ASTOUND Initiative was formed towards addressing three key elements in the effort of building new and diverse investment business models for creative content enterprises in Ontario. The workshops will address training. The Salons will address collaboration and knowledge exchange. The Summit intends to incorporate audience voices.The end goal is a systematic approach that encourages private investment in content-based businesses in Ontario.↑↓Lead Partners. Getting things done.The ASTOUND Initiative is led by CFC Media Lab in partnership with Hot Docs, OCADU and is made possible through The Entertainment and Creative Cluster Partnerships Fund administered by the Ontario Media Development Corporation (OMDC) on behalf of the Ministry of Tourism and Culture, and Sport. Tertiary Partners. Working together."},{"title":"Speaker Bios","date":"2016-06-15T22:53:33.000Z","updated":"2016-06-16T01:17:45.000Z","comments":true,"path":"bio/index.html","permalink":"http://www.astoundinitiative.ca/bio/index.html","excerpt":"","text":"Speaker Bios. Duncan CorkCEO/Co-FounderSlated- Entrepeneur- Film EnthusiastAs Slated’s CEO, Duncan provides day-to-day creative and strategic leadership to the business and its partnerships. Duncan created the initial vision for Slated and subsequently founded the company in 2010 with his co-founders.He claims that the system of financing independent film is “broken” so he along with co-founder Stephan Paternot created Slated where credible projects could connect with legitimate financiers to invest in their movies.Formerly, Duncan was Executive Creative Director of Katharsis in London, which is now based in New York.About SlatedSlated is an online marketplace for film financing and dealmaking — connecting a global network of investors, filmmakers and industry professionals. Backed by prominent angel investors in the entertainment and finance communities, Slated has built a passionate management team with experience from major studios, technology, and financing companies. Top of pageAndrew FisherExecutive Vice PresidentWesley Clover InternationalAs Executive Vice President, Andrew manages a portfolio of assets in the technology and media sectors under the Wesley Clover International umbrella and is an active board member and Executive Producer for Glitchsoft Corporation, March Entertainment, Solink Corporation, Martello Solutions and National Angel Capital Organization. Andrew is a media chair for the Canadian Department of Foreign Affairs and International Trade and an advisor to The National Research Centre Industrial Research Assistance Program. Previously to Wesley Clover, as co-founder of NewHeights Software Corporation, Andrew managed Service Provider and Large Enterprise accounts globally.Andrew has an academic background in both economics and computer science and engineering and is an honors graduate from the University of British Columbia.About Wesley CloverWesley Clover is in the business of building businesses. Wesley Clover has an outstanding and enviable track record as an equity and investment management firm with active interests in Information and Communication Technologies, Digital Media, Real Estate and Leisure Properties. Top of pageMary BarrollPresident &amp; Executive ProducerMbmediaLawyerMary Barroll practices business law with an emphasis on entertainment, technology and intellectual property. Her clients include producers (television, film &amp; new media), television broadcasters, funding agencies, developers (software and website) among other businesses related to traditional and new media industries. Mary is also an evaluator of applications for funding by the Bell Broadcast and New Media Fund and was commissioned to develop a series of annotated legal agreements to educate new media producers about issues that arise in cross platform projects, published on the Bell Funds website.Mary has won numerous national industry awards and in 2008, she launched a cross platform media production company, Mbmedia, for which she serves as President &amp; Executive Producer. Mbmedia’s first production, THE BODY MACHINE, was nominated for a Rockie Award at the 2009 Banff World Television Festival, nominated for two 2009 Gemini Awards and won a special jury prize at the 2009 Gold Panda Awards in China. Mary then exec produced the feature film, BEAT THE WORLD, which was released in 2011 and has been sold throughout the world. Mbmedia is currently in development on a number of television and film projects with national and international partners.Mary obtained her B.A. (1984) from the University of British Columbia, her Broadcasting Arts Degree (1986) from Mount Royal College and her LL.B. (1994) from Queen&#8217;s University. She is called to both the Ontario (1996) and Alberta (1997) Bars. Mary is currently completing her Masters of Law degree specializing in E-Business , studying emerging issues involving new media, online entertainment and commerce at Osgoode Hall Law School.Mary carries on her own legal practice and contributes through volunteer work. Top of pageLalita KrishnaFounderBreakout MediaCo-ChairDocumentary Organization Canada (Toronto Chapter)Board MemberHot Docswww.insyncvideo.caResponding to the shift in audience from Television to Interactive Media, Lalita founded Breakout Media in 2008, an Interactive production company that produced the successful award winning series ‘Breakout!’, with the CBC. Lalita also heads Doc Shift a two-year initiative funded by the OMDC which has an ambitious goal to develop the core capacity of producers to create cutting edge transmedia documentaries that can be marketed internationally. Lalita’s documentaries on kids who change the world have had successful sales in the Canadian and international educational markets.She combines her background in education with her strong skills in communication to create powerful non-fiction productions that are able to captivate and hold audiences. Lalita has participated and moderated trade and business and educational panels. She presents workshops and is a featured speaker at prestigious professional development events. Lalita’s current projects include a transmedia documentary on Chocolate and a feature documentary on the growth of organized retail in India.Lalita Krishna is a multiple award winning filmmaker whose work has been broadcast in Canada on all major networks, and featured at film festivals around the world. Lalita worked for several years in educational production with TVOntario. Lalita has also taught in the Journalism Programs at Ryerson University, at George Brown College and at the Summer Institute of Mount Saint Vincent University. Lalita has been awarded the Dreamcatcher Award for using her craft to better humanity and the Trailblazer 2010 award from the Reelworld film festival. Her films have won multiple awards and continue to be screened at various international film festivals. Top of pageGlenn Paradis, CFA, CAIAFounder &amp; CEOClairwood Capital ManagementPartner/DirectorArrowleaf EntertainmentCFOUnity Broadcasting Corp.Glenn Paradis has over 20 years of experience in the Investment Management business and is the Founder &amp; CEO of Clairwood Capital Management, a Toronto based alternative investment manager with a focus on Media finance. He is also a Director and Partner with Arrowleaf Entertainment Properties based in Calgary, a media investment, strategy and advisory firm. Glenn has also recently taken on the role of Chief Financial Officer at Unity Broadcasting Corp. a content provider based in Kelowna to advise them on raising growth capital.In his spare time he sits on the Education &amp; Research Committee for the Alternative Investment Management Association (AIMA) Canada and is a sustaining member of the Professional Risk Management Association (PRMIA).Glenn is an avid traveler and enjoys getting involved in projects and causes that help to drive positive social change. Top of pageAnne Marie MaduriPresidentMaduri &amp; AssociatesAs part of her role at Maduri &amp; Associates, Anne provides financial advisory services and assists digital media, and entertainment related technology companies, on building sustainable, value maximizing business models and assists them in securing investment.Since 1998 she has worked with numerous investment banks, and as an independent agent and advisor. Her experience is in equity analysis and investment banking focused on the digital media sector and its components including software, hardware, entertainment, and telecom companies.Her academic background is in literature &amp; art history, media &amp; technology theory, accounting, computing, and corporate finance. She continues to pursue media, technology &amp; communication theory as well as capital markets and corporate finance research. Anne was also an award winning theater producer. Top of pageDebra McLaughlinPresidentStrategic Inc.Vice PresidentAirtime Television SalesDebra McLaughlin is the founder and managing partner at Strategic Inc. where she oversees a team of consultants providing consumer and market insights to a wide range of media clients. These insights are used to develop business plans and complete economic impacts analysis for clients working in media. As well as managing Strategic Inc., Debra has been a Vice President at Airtime Television Sales overseeing operations for the sale of over forty stations in Canada and the US. Prior to this Debra worked at BBM (the industries audience measurement firm), McCann Erickson advertising agency (on accounts such as Coca Cola, Mr. Christie and Government of India), J. Walter Thompson agency (on Warner Lambert and Labatts) and as a consultant at both PriceWaterhouse Coopers and Nordicity. Debra has her MBA from Queens University where she finished at the top of her class with a specialization in finance. She completed a degree in Industrial Psychology at Carleton University and an undergraduate degree from London. Her resume includes global focused work in Switzerland, China and the US.About Strategic Inc.Strategic Inc. is a boutique consulting firm that has been in operation since 1994. The company specializes in providing insights in consumer behaviour including analysis of syndicated database and creation of custom research. Working in the regulatory field as well as the marketing and programming area, Strategic Inc, has provided assistance to a wide range of clients in obtaining, modifying and launching new broadcast licenses. Program testing, format design and brand mapping are some of the services provided. Clients include the CRTC, CBC, Bell Media, AMC, Harvard Broadcasting, Fox Networks, APTN, Rogers Media, CMPA, CMF, Telefilm, Evanov Broadcasting, AMI. Top of pageTodd CherkaskyVice President, Global Lead Research &amp; InsightsSapientNitro- Consumer Intelligence Leadership Team Member- Experience Innovation Team MemberTodd performs several key roles at SapientNitro and as such leads a global team of researchers (both design and experience); ethnographers, social insights analysts, and strategists who generate deep insights into consumer experiences and leverages the work to generates thought leadership, designs strategies, and creates omni-channel customer experiences responsive to emerging technology and cultural trends. This kind of work greatly supports SapientNitro&#8217;s portfolio of clients including Chrysler, BMO Financial, Citi, J&amp;J, Santander, Hyatt, Coca Cola, Disney, Cigna, Verizon, and BBVA among many other global brands. With over 15 years in research and strategic planning, Todd has published and presented widely on human-centered design and has developed new business models, digital strategies, and high-performance work systems. Todd has been project lead or client executive for General Motors, Samsung, McDonald’s, UPS, and other global brands.Todd received Ph.D. and M.S. degrees from Rensselaer Polytechnic Institute in the study of technology design and workplace change. He has a B.S. in Computer Engineering and B.A. in English Literature from the University of Michigan. He also was the conference chair for the Sixth Biennial Conference on Participatory Design. Top of pageSuzanne SteinProfessor, Strategic Foresight &amp; InnovationOCAD UniversityProfessor, Digital FuturesOCAD UniversityProfessor Stein works within both Digital Futures and Strategic Foresight &amp; Innovation graduate-level programmes at OCAD University. Her areas of expertise include: creative techniques, strategic foresight, and research methods. She also works as a Mentor in the CFC&#8217;s business incubator: ideaBOOST and as a workshop leader at Institute Without Boundaries (IWB). Previously Suzanne was Deputy Director and Principal Research Fellow in Technology Futures at SMARTlab (United Kingdom) and part of Nokia Corporate Strategy’s Insight &amp; Foresight group.Her earlier work included Sapient Corporation, as Discipline Lead for the Experience Modeling (XMod) group in London, and Director of the User Experience Group. Top of pageRamtin LotfabadiManagerOnline Architecture and DevelopmentFaculty Member, Liberal Arts and Science (Seasonal Faculty)OCAD UniversityRamitin’s current area of research include Human Factors, Complex Information Systems and Learning Technologies and his teaching focus’ are in Mathematics and Logic, Computational Theory and Data Analytics.Ramtin did undergraduate studies in Mathematics attending the University of Guelph, as well he studied Film at Ryerson University. He completed his Master of Design, Strategic Foresight and Innovation at OCAD University and is a PhD Candidate, Systems Design Engineering at the Univesity of Waterloo. Top of pageAaron WilliamsonPresidentThe Value WebFacilitatorBusiness Model Canvas WorkshopASTOUND/CFC Media LabAs a management consultant, designer and facilitator, Aaron brings a broad range of skills focused on a single purpose; creating solutions out of chaos and complexity. Aaron designs collaborative workshops to help people solve problems, and create immersive visualizations to help those people communicate their answers to the world.With experience in delivery of fast-paced business strategy and transformation workshops, Aaron is passionate about creating collaborative solutions for clients with complex issues involving diverse stakeholders with a common, urgent need for change. Through process design, graphical modeling and graphic facilitation, Aaron has enabled groups to distill complexity into actionable outcomes. Top of pageEric Leo BlaisDigital and Emerging Media Strategist- ProducerEric&#8217;s core strengths lie in assessing clients’ business requirements and delivering creative digital business solutions to real world challenges. He communicates with developers and customers in terms they understand. Whether the scope of the project is $5,000 or $1,000,000, Eric ensures that the project is not only delivered on time but under budget.Eric has been helping two new startups: SlingRide, a ride-sharing portal, part of the JOLT startup accelerator program at MaRS and The Ghost Town Project, part of the CFC’s ideaBoost.In 2009 and 2010, he secured over a million dollars in financing with the Ontario Media Development Corporation, the Bell Broadcast and New Media Fund and the Canada Media Fund’s Experimental Stream to produce a series of lifestyle mobile and tablet applications for the iOS, Android and BlackBerry devices. Eric continues to develop proven cost-effective, creative business tools and marketing solutions for a wide range of industries including: information technology, entertainment, automotive, health &amp; fitness, legal and human resources.Eric holds a degree in Art from the University of Ottawa, a certificate in Design Management from Ryerson University and has recently completed a Masters of Design in Strategic Foresight and Innovation at OCAD University. Top of pageWarren CoughlinProfessor- Lawyer- Actor- Theater Director- TrailblazerWarren is a rarity. A few days after birth, Doctors told his parents that he had about a zero chance of survival, but here he is today. At 13, he lost all his hair (back when everyone was a hippy), but he never got bullied and when you meet Warren you will get a sense why.He studied Business &#8211; but was told he was a Communist (for suggesting employers should consider the welfare of their staff in decision making), he backpacked through Southeast Asia, helped fisherman in Tunisia and became a Bay St. lawyer. He’s been a college professor, an actor and theatre director. He’s now a business coach for entrepreneurs, especially ethical ones. And he’s on the board of The Funding Network and Street Kids International. We have no idea what he’s going to talk about (as is the case with Warren), but you won’t want to miss it. Top of pageAna SerranoChief Digital OfficerCanadian Film CentreFounderCFC Media LabAna is the Chief Digital Officer of the Canadian Film Centre and Founder of the CFC Media Lab, the world-renowned and award-winning institute for interactive storytelling created in 1997 at the Canadian Film Centre.With her visionary direction and digitally-forward approach to organizational growth, Ana built the CFC Media Lab into a unique blend of training facility, incubator, and creative production house, that continually re-invents itself as new media demand new approaches – from the early exploration of Web-based entertainment, to today&#8217;s world of mobile smart-phones and iPads.To date, she directed the development of over 130 interactive media projects, mentored over 50 start-ups and produced some of Canada’s seminal works in interactive media including the influential Great Canadian Story Engine, one of the world’s first digital storytelling sites and Late Fragment, the first interactive dramatic feature film to be featured at the Toronto International Film Festival and distributed by Mongrel Media.Ana is a three-time winner of awards from the Canadian new media industry, and frequently speaks at digital media and film festivals around the world about the emerging realms of interactive art and entertainment. She has sat on boards as varied as the Canadian Conference of the Arts, Virtual Museums of Canada, Laidlaw Foundation, and McLuhan International Multimedia Festival. Currently, she is active on the boards of Artscape, Kapisanan Arts Centre and several start-up companies focusing on interactive entertainment. She is also an Advisor in the Information, Technology and Entertainment Practice at MaRS Discovery District. Top of pageAmar WalaFilm Maker- Producer- WriterAmar is an award-winning filmmaker based in Toronto, Canada. His short film, THE GOOD SON, had its world premiere at The 4th Annual Dubai International Film Festival, and went on to screen at festivals around the world and win several awards in Canada. In 2008, Cameron Bailey (Director of Toronto International Film Festival) named Amar one of the Top Ten Local Filmmakers.His new project is a feature length documentary called The Secret Trial 5. The Secret Trial 5, is a documentary on the balance between human rights and security in post 9/11 Canada and is a great example of a crowdfunding success story.Amar was born in Bombay, India, and moved to Toronto with his family at the age of 11. He has a degree in Film Production from York University, and believes deeply in moviemaking’s ability to change minds and create discussion. Top of pageCorey VidalOn Line Content Producer- Digital Media ConsultantAt the age of 21, Corey was one of the first Canadians to join the YouTube Partnership Program.As of July 2103, Corey has over 200 videos posted on his YouTube channel has over 200,000 subscribers, his channel profile has been viewed over 9 million times and his videos have been viewed over 67 millions times!In February 2013 he was named Niagra’s Entrepeneur of the Year in Innovative Small Business for his video production company ApprenticeA Productions.Corey will be providing another space at which YouTubers can show off their work with the launch of Buffer Festival, a truly innovative festival with a lineup composed entirely of YouTube content and for the first time bring the stars of YouTube out to meet their audience and fan base. Top of pageZan ChandlerFounderZancomMediaResearcherForesight AnalystZan is the principal of ZancomMedia, a consultancy that focuses on research, strategic thinking and foresight. Her strategic thinking work has informed program design at Canada’s arts funder and branding audience development initiatives for artists and media producers. Her past research projects have touched areas such as Canada’s international audiovisual co-production agreements, the emergence of web series, the performance of Canadian films on the international film festival circuit and audience engagement techniques used by digital entertainment companies. Zan Chandler has 20+ years of experience working in the cultural sector. Zan started out working in independent film in Toronto, spent a decade at the Department of Canadian Heritage and the Canada Council for the Arts (focusing on research and policy development in arts, film/broadcasting and digital media), and has participated in a variety of foresight studies that examine the futures of media industries and economic policy development in Ontario. Top of pageElizabeth RadshawIndustry Programmes DirectorHot DocsElizabeth Radshaw is the Industry Programmes Director at the Hot Docs Canadian International Documentary Festival. She oversees the festival and year-round industry programmes. At its centre is the Hot Docs Forum, a documentary film pitching forum which provides a unique opportunity to pitch feature documentaries, series and interactive documentary projects to financers as well as the Hot Docs Deal Maker, a curated works-in-progress pitch-meeting program between producers and international decision makers. Additionally, she curates the Conference and other market events. Elizabeth established and runs Doc Ignite, Canadian documentary crowd-funding site as well as the Shaw Media Hot Docs Fund and Hot Docs Blue Ice Group Fund, documentary production fund for residents of Africa.Prior to this appointment, she was the Head of Acquisitions at TVF International. She was an elected member of Pact Council in the UK in 2007. She joined TVF from the National Film Board of Canada and has a history of dramatic and factual production of film and TV in North America. She directed the Brooklyn based Rooftop Short Film festival at its Montreal premiere in 2005. Top of pageOrla GarriquesProject ManagerAstound InitiativeCo-FounderDruMeBa Inc.- ProducerOrla is a multi-faceted producer and programmer working at the intersection of television, film, new and is the Project Manager for the ASTOUND Initiative, an ambitious new venture that seeks to encourage private investment in Ontario&#8217;s creative content industries.She is co-founder of DruMeBa Inc. an interactive media and social purpose business that develops systems and software that assist children with ASD and related cognitive disorders. She has worked for award-winning production companies and leading media organizations in the areas of development, business affairs, marketing/sales and audience engagement for a range of entertainment brands such as WestWind Pictures, Hungry eyes Production and Inner City Films.Orla is an alumna of the Canadian Film Centre. She is passionate about the use of media to create collaborative experiences that engage audiences in traditional and non-traditional environments. Most importantly, she is committed to use of media and the arts as a means to engage, entertain, educate and empower. Top of pageChloe Sosa SimsIndustry ProgrammerHot DocsMarket CoordinatorHot DocsChloe is multifaceted media enthusiast who curates and coordinates a number of projects including the Astound Initiative, the Blue Ice Group Documentary Fund and DocIgnite to name a few. She also oversees the Rendezvous Program (and various other industry programs) during the Hot Docs Festival.Chloe has developed her skills in the area of film &amp; television distribution while working at Maple Pictures, as well as working in the area of Client Management at the platform agency and aggregation house Juice Productions. More prominent is her background and current efforts in film festival work which have spanned TIFF, the Banff Media Festival and today as the Industry Programmer and Market Coordinator at Hot Docs.Chloe graduated from Queen’s University with a Bachelor of Arts (Honours) in Film &amp; Media Studies and Drama. Top of page"},{"title":"Contact","date":"2016-06-15T22:53:33.000Z","updated":"2016-06-16T01:22:56.000Z","comments":true,"path":"contact/index.html","permalink":"http://www.astoundinitiative.ca/contact/index.html","excerpt":"","text":"↑↓Contact. Take the first step.Content Investors and Content ProducersInvestors and content creators interested in finding out more and furthering the goals of this initiative contact Orla Garriques. ContactRequest to join our LinkedIn GroupBusiness Model Canvas Workshop &#8211; BookingWorkshops are available in full day and ½ day sessions, tailored to your constituents&#8217; needs and year-round program.If you are a Media Organization that would like to book a workshop, please submit an online application. Apply"},{"title":"ASTOUND Salons","date":"2016-06-15T22:53:44.000Z","updated":"2016-06-16T03:39:34.000Z","comments":true,"path":"more_salon/index.html","permalink":"http://www.astoundinitiative.ca/more_salon/index.html","excerpt":"","text":"What can it mean to invest in creative content?Breaking-down and addressing misconceptions and preconceptions towards building a healthy investor-creative community. From investment models and data requirements/analysis to terminology and pitch approaches.How does the “Business Model Canvas” apply to seeking investment?Evolving Osterwalder’s “Business Model Canvas” design to include investment points relevant to Ontario’s creative content industry and various genre-based businesses (film, tv, gaming, social and digital media).How are Audience and Social Impact valued, measured and leveraged for capital-investment?Examining various audience engagement strategies (i.e. crowdsourcing, crowdfunding) and Social Impact approaches that content creators can leverage to mitigate risk for potential investors.How can investors and content creators work together across multi-platform content investments?Dissecting contracts with guest experts from legal, accounting and business affairs to identify best-practices between investors and content creators working on multiple-platform content.What does it mean to be Pitch-Ready for Investors?Content creators are used to pitching for different types of funders often for broadcasters, distributors, films funds and platforms. This salon, we explore what needs to be conveyed when pitching to different types of investors.How can we evolve the existing financing models to incorporate new elements from these other industries?This Salon, we examined existing financial models for the Creative Content industry as wells explore models from other industries that can be adapted in order to identify new financial frameworks aimed at Creative Content Producers in Ontario, especially micro/small enterprises.‹›The ASTOUND Salons.During the first decade of this millennium, the Creative Cluster has emerged as a major – and growing – source of GDP for Ontario. The creative industries in Ontario generate $12.2 billion in GDP for Ontario’s economy annually and are number one in Canada by GDP. Creative industry GDP is now larger than Ontario’s energy industry, is approaching 70% of the auto manufacturing sector and surpasses those of agriculture, forestry and mining sectors combined.ASTOUND is a meeting place for content creators and the investment community. The initiative strives to build relationships and create networking opportunities to showcase the investment potential of Ontario&#8217;s creative content sector. It is a young, vibrant sector now learning to access private investment for growth.ASTOUND is the common ground for knowledge exchange, networking and collaboration.Salon Committee. Elizabeth RadshawHot Docs Chloe Sosa-SimsHot Docs Janelle ZoeHot Docs Ana SerannoCFC Media Lab Orla GarriquesASTOUND/CFC Media Lab Sabrina BulleyASTOUNDSalon Working Group.Ray BrooksSocial Impact Angel InvestorSean BuckleyBuck ProductionsAndrew FisherWesley CloverNathon GunnSocial Game UniverseLalita KrishnaInSync MediaAnn Marie MaduriMaduri Laird PartnersCharles OfficerCaneSugar FilmworksMarva OllivierreDoeeye MediaGlenn PardisClairwood Capital ManagementPhil SchmittSummerwoood Group Inc.Sample of Past Events.ASTOUND Salons are exclusive cinq à sept session to learn and discover dynamic possibilities of investing in the creative content space in Ontario and further.ASTOUND Initiative invites you to discover diverse investment opportunities in Ontario’s creative content sector.Investing in ContentAndrew FisherExecutive Vice President, Wesley CloverUnlocking the Investment Potential of Canadian Content IndustriesDuncan CorkCEO and Co-Founder, SlatedThe Future of Private Investment in the Film IndustryAccessing private investment by numbers:Data and analytics for the creative content sectorAnne Marie MaduriPresident, Maduri &amp; Associates Inc.How to use Metrics in Building Business Models and the Investment Pitch.Debra McLaughlinPresident, Strategic Inc.The Value of Audience Engagement Techniques and how Analytics are used in the Broadcast/Digital Environment."},{"title":"ASTOUND Summit","date":"2016-06-15T22:53:48.000Z","updated":"2016-06-16T03:39:34.000Z","comments":true,"path":"more_summit/index.html","permalink":"http://www.astoundinitiative.ca/more_summit/index.html","excerpt":"","text":"Download a PDF version of the: Map / ScheduleThe ASTOUND Summit:The Business of Audience EngagementAre you a filmmaker, television producer, app developer, game designer, interactive producer, mix media artist, self-publisher, musician, composer? Do you have a digital media project or start-up company that you are trying to get off the ground?Are you ready to make the shift from content producer to content entrepreneur? Then the ASTOUND SUMMIT is for YOU!The&nbsp;ASTOUND&nbsp;Summit: The Business of Audience Engagement&nbsp;is a one-day FREE symposium&nbsp;for content entrepreneurs to explore the importance of connecting with their viewers and users. We will explore how to best&nbsp;integrate audiences and leverage these relationships to secure financing and investment.You will hear from expert industry practitioners on:proven strategies regarding crowd-sourcing, crowd-funding, and audience engagement; cutting-edge tools &amp; techniques to engage audiences; andpractical lessons on how to interpret and apply user data Applied ClinicsBring your project with you or pre-submit your projects by Wednesday, October 16th for an incredible development opportunity to have your work selected and work-shopped during the afternoon clinics. Details below. Summit Committee. Tom BarkerOCADu Monica ContrerasOCADu Suzanne SteinOCADu Ajay JoshiOCADu Ana SerannoCFC Media Lab Orla GarriquesASTOUND/CFC Media Lab Elizabeth RadshawHot Docs Chloe Sosa SimsHot DocsSummit Schedule.The&nbsp;ASTOUND&nbsp;Summit&nbsp;took place&nbsp;on October 19th, 2013 &#8211; 8:00am to 6:00pm&nbsp;at&nbsp;OCADU&nbsp;..agenda th, .agenda td {border: solid 1px #ddd;padding: 5px;}.agenda p.lead {margin: 0 !important;}.agenda .nowrap {white-space: nowrap;}.agenda li {margin-bottom: 10px;}MODULE 1: AUDIENCE &#8211; DRIVING A NEW MARKET PLACE REALITY8:00REGISTRATION &amp; INFO DESK8:30 &#8211; 9:15BREAKFAST: LAMBERT LOUNGE9:15 &#8211; 9:45INTRODUCTION &amp; WELCOME ADDRESS BY ASTOUND TEAM; PARTICIPATORY DESIGN TECHNIQUES (PDT): Integrating Audience In A Meaningful Way Throughout The Production Value Chain Speaker: Suzanne Stein9:45 &#8211; 10:00BREAK10:00 &#8211; 11:00THE ART &amp; SCIENCE OF CONSUMER INTELLIGENCE: How The Shift Towards &#8220;Experience&#8221; Impacts The Field Of Consumer InsightsKeynote Speaker: Todd CherkaskyMODULE 2: NEW TOOLS OF THE TRADE11:00 &#8211; 11:20DATA AND ANALYTICSPresented By: Ramtin Lotfabadi11:20 &#8211; 11:50BUSINESS MODEL CANVASPresented By: Aaron Williamson11:50 &#8211; 12:10SOCIAL MEDIA STRATEGIESPresented By: Eric Blais12:10 &#8211; 12:30THE ART OF PITCHINGPresented By: Warren Coughlin12:30 &#8211; 1:30LUNCH (provided on site for all participants)1:30 &#8211; 2:30AUDIENCE ENGAGEMENT ROUND TABLE DISCUSSIONCorey Vidal (Apprentice A), Amar Wala (The Secret Trial 5),&nbsp;Suzanne Stein (ideaBOOST), Anne Marie Maduri (ASTOUND Initiative) and Ana Serrano (CFC Media Lab/CFC)2:30 &#8211; 2:45BREAKMODULE 3: CLINICS (2:45 &#8211; 5:30)2:45 &#8211; 3:30Participants are encouraged to pre-submit their projects by Wednesday, October 16th for an incredible development opportunity to have their work selected and work-shopped in following the following clinics:&nbsp;INTEGRATING PARTICIPATORY DESIGN TECHNIQUESFacilitated By: Suzanne Stein &amp; Zan ChandlerDEFINING YOUR BUSINESS MODELFacilitated By: Ana Serrano, Aaron Williamson &amp; Orla GarriquesGROWING YOUR AUDIENCE THROUGH SOCIAL MEDIA STRATEGIES Facilitated By: Eric BlaisTRACKING YOUR AUDIENCE THROUGH DATA AND ANALYTICSFacilitated By: Ramtin LotfabadiPITCHING EFFECTIVELY BY KNOWING YOUR AUDIENCEFacilitated By: Warren Coughlin,&nbsp;Anne Marie Maduri, Elizabeth Radshaw and Chloe Sosa SimsBreak (15 mins)3:45 &#8211; 4:30Break (15 mins)4:45 &#8211; 5:305:30 &#8211; 5:45BREAK5:45 &#8211; 7:00CLOSING RECEPTION"},{"title":"ASTOUND Workshops","date":"2016-06-15T22:53:52.000Z","updated":"2016-06-16T03:39:34.000Z","comments":true,"path":"more_workshop/index.html","permalink":"http://www.astoundinitiative.ca/more_workshop/index.html","excerpt":"","text":"‹›The ASTOUND Workshops.Since 2011 ASTOUND has been collaborating with leading media organizations such as TIFF, Women In Film &amp; Television (WIFT-T), Hot Docs and NXNEi to train content producers and management teams working in film, television, gaming, mobile, interactive, transmedia and music on business model design.The ASTOUND workshops are hands-on workshop that takes participants through the creation of a “business model canvas” using the Alexander Osterwalder method, evolved by CFC Media Lab, for the creative content industry. This workshop takes a participatory approach to create an empowering and interactive working environment that fosters understanding, discussion, creativity, and analysis.The ASTOUND: Business Model Canvas Workshop (BMC workshop) trains content producers to use business model tools and techniques. The business Model Canvas provided a single easy-to-use visual tool allowing users to quickly map their productions and/or businesses, assess viability, realize potential revenue streams, better understand their value proposition, re-imagine their unique business model and investment potential.Through the BMC workshop participants take away a tangible blueprint for their current and future, as well as tools that they can adapt as part of their on-going business practices.Workshop Facilitators. Ana SerannoCFC Media Lab Aaron Williamson Orla GarriquesASTOUND/CFC Media LabBusiness Model Canvas.The success of Alex Osterwalder’s Business Model Generation book and workshops has resulted in the demystification of business model design.The Business Model Canvas is used as a design tool to help businesses get their first principles right starting with who their customer might be. For content-based businesses, especially in Canada where a good proportion of “revenues” are typically derived from government subsidies, knowing for whom you are creating your film, book, ipad app, etc. may be, at best, answered in broad demographic terms (e.g. 18-25 females) or at worst, not answered at all.The Business Model Canvas is a fun, visceral way of encouraging content-based businesses to answer key questions head on. More importantly, it sets out that business modeling is an iterative design process that is at heart “creative.” It underscores how business modeling should be integrated into the content-based industry’s creative process every step of the way.View the 2 minute overview of the Business Model Canvas, a tool for visionaries, game changers, and challengers.Workshop Participants.Sherien BarsoumTaza MediaNina BeveridgeGhosts MediaVladmir BravoLindsay CastelProduction Supervisor for Family Channel and Disney XD CanadaKaren ChapmanCreative ConquerorsSidney ChiuSC ProductionsFuad ChowduryUNL Canada Inc.Craig Allen ConoleyPartus FilmsRebecca DaveyBT ProductionsTamara DawitGobez MediaPaula DevonshireDevonshire ProductionsDaniel EpsteinProcter &amp; Gamble FengliNanjing Broadcasting CorporationNicole Hilliard FordeSide Street ProjectMalinda FrancisHaiti – CMP 2012.pJackie GarrowDocumentary Organization of Canada – Toronto Chapter GelarehHessam GhorbanianParatoo Film / vod onlineHugh GibsonChapeaul FilmsLauren GrantClique PicturesRyan GranthamPost-Production SupervisorRTR MediaRyley GrunenwaldMarie Verite FilmsJoanna GryfeContent AcquisitionShaw MediaMateo GuezTheo FilmsAmy HampsonLifestyle Writer and Website ManagerShaw MediaCher HawryshPhenomenal FilmsAllison HillierAngela JoyceExtreme Entrepreneurs – CMPKelli Kieleykamm/era media groupIndrani KopalHofstra UniversityDawn KuismaBlaze ProductionsMichael LeeCultuvistaMichael LeeMahala MediaTricia LeeA Film Monkey ProductionsStephanie LevyPossibility EntertainmentLawrence LoewingerTwo Points FilmsCarmen Elsa LopezCows in the FieldYan LuHunan TV StationKarnit MandelIndependentJohanna MavhunguMLB Media SolutionsShana McCallaReggae MovementsCat McCormickAntica ProductionsPeter MiddletonFee Fie Foe FilmsLaura MillikenBig Soul ProductionsSarah MoffatSarah Moffat ImageryTshego MoleteHappy Brown Babies ProductionsToni MorganCharles OfficerCaneSugar FilmworksMargarita RamonTerra Incognita ProductionsMonica RichardsonInwood Girl ProductionsKelly-Anne RiessRiess StormmediaHovsep SeraydarianAdam ShamoonDocumentary Organization of Canada – Toronto ChapterCarla SinclairEmpty Cup MediaTina-Louise SmithAccidental Films and TVSosena SolomonA Dopest Ethiopian ProductionsAnastasia TrofimovaAna ValineGideon GirlsSylvie Van BrabantLes Productions du Rapide-BlancShiren Van CootenBebamikawa ProductionsLouise Van HoffOkuhle Media, South AfricaQasim Virjeegetfilmi.comTony VlismaLindsey VodarekManagerCMPA &amp; Independent Doc ProducerVibeke VogelBullitt Film, DenmarkAmar WalaSecret Trial 5 Productions Inc.Douglas WarrenAki WatanabeExpress Sports Co. LtdRobin Welchkamm/era media groupJames WilkesLe Cheval NoirHan XiaominFrancine ZuckermanZ Films Inc."},{"title":"Program","date":"2016-06-15T22:53:57.000Z","updated":"2016-06-16T03:39:34.000Z","comments":true,"path":"program/index.html","permalink":"http://www.astoundinitiative.ca/program/index.html","excerpt":"","text":"↑↓ASTOUND Workshops. Business Modeling Tools and TechniquesCreative Start-ups exemplify the potential for creative industries to spearhead economic and cultural development. As digital media have lowered the entry barriers to produce and distribute content, Creative Start-Ups are embracing the opportunities. The ASTOUND Initiative encourages content creators to think entrepreneurially, explore their unique offerings, revenue potential and understand their business model through the ASTOUND Workshop.Using the Business Model Canvas ASTOUND Workshops will train producers to use the techniques of business model design as set out by Osterwalder and his associates, and evolved by the CFC Media Lab. Specifically targeted to content-based businesses in the digital and interactive media, film and TV, publishing and gaming sub-sectors to provided training and networking opportunities. Through interviews and tracking the business model patterns that emerge we will compile the definitive list of successful business models for Canadian content-based industry and provide new tools and resources with a investment-readiness approach. Learn more&nbsp;↑↓ASTOUND Salons. Networking and Knowledge ExchangeThe global entertainment and media market was estimated to be worth more than US$1.35 trillion in 2008, and is forecast to grow to approximately US$1.6 trillion by 2013.1 Creative industries now represent a significant proportion of many countries’ GDPs, as economies around the world recognize the importance of the creative industries to their future economic growth. As the “knowledge” versus “industrial” economy continues to grow in importance across all developed and developing countries, creative industries are critical to the larger knowledge economy job creation engine, preparing workers for a digital future that relies on creativity versus physical work.excerpt from Ontario’s Creative Cluster reportFocusing on Creative Start-Ups leads to more nuanced perspectives. Creative Start-Ups are becoming less wedded to the existing business models and better positioned to exploit alternative paradigms. Marrying the culture of investors with that of content creators is essential to the success of the ASTOUND Initiative. The ASTOUND Salons are a series of private and public events focused on bringing investors alongside content entrepreneurs to create a common language and map potential points of engagement between these two cultures. The Salons provide an environment where investors and content creators can collaborate to write a sop and common language around diverse investment business models. Learn more↑↓ASTOUND Summit. The Business of Audience EngagementContent Creators are bypassing record labels and studio deals in favor of alternative business models, relying on online platforms to connect with their fans and funders.The ASTOUND Summit will assess and survey various crowdsourcing, crowdfunding, and audience engagement strategies that have been successful. Although a strong team and a solid track record can go a long way to attract potential investors, for the most part having a handle on what the potential ROI on any given project may be is still critical to closing the deal. We believe that integrating audiences meaningfully throughout the production value chain, and tracking their engagement along the way can be used to mitigate the risk for potential investors. Learn more"},{"title":"Resources","date":"2016-06-15T22:54:02.000Z","updated":"2016-06-16T01:20:20.000Z","comments":true,"path":"resources/index.html","permalink":"http://www.astoundinitiative.ca/resources/index.html","excerpt":"","text":"↑↓Tools. Use them wisely.Business Model CanvasThe Business Model Canvas Design techniques gives entrepreneurs an opportunity to organize their business plans in a central place by putting ideas into key categories that allow them to see a visual snapshot of their plans and connect the areas to see if they make sense, while being versatile enough to make quick changes, build on it, or make important decisions on whether to keep it, or scrap it.The Business Model Canvas is a fun, visceral way of encouraging content-based businesses to answer these questions head on. More importantly, it sets out that business modeling is an iterative design process that is at heart &#8220;creative.&#8221; It underscores how business modeling should be integrated into the content-based industry&#8217;s creative process every step of the way. Download businessmodelgeneration.comValue Proposition CanvasThe goal of the Value Proposition Canvas is to assist you in designing great Value Propositions that match your customer&#8217;s needs to solve their problems. This is what the start-up scene calls product-market fit or problem-solution fit. The Value Proposition Canvas helps you work towards this fit in a more systematic and visual way. Download businessmodelgeneration.comStrategyzerStrategyzer is an online application that allows you to electronically visualize your business model canvas, while going deeper by allowing you to be constantly connected and up-to-date with your team, understand if your business model will fail or succeed through a testing process, estimate your financial opportunities, and more&#8230; strategyzer.comSparkwiseSparkwise is a cloud-based metrics platform. The service, which is still in beta, takes data from a user’s various social media feeds and transforms that raw data into stories by incorporating video, audio and text.Sparkwise gives meaning to your data and momentum to your goals. Visualize, compare and curate your data to tell your story and ignite your audience. Data can be a powerful tool for change. Tracking the right metrics in the right context can help us gain a deeper understanding of the communities we serve, so we can make a lasting impact. sparkwi.se ↑↓Books. Digital or paper.Business Model GenerationBusiness Model Generation is a practical, inspiring handbook for anyone striving to improve a business model or craft a new one and change the way you think about business models.Business Model Generation will teach you powerful and practical innovation techniques used today by leading companies worldwide. You will learn how to systematically understand, design, and implement a new business model or analyze and renovate an old one. Preview businessmodelgeneration.comBlue Ocean StrategyExamining a wide range of strategic moves across a host of industries, Blue Ocean Strategy highlights the six principles that every company can use to successfully formulate and execute blue ocean strategies. The six principles show how to reconstruct market boundaries, focus on the big picture, reach beyond existing demand, get the strategic sequence right, overcome organizational hurdles, and build execution into strategy. In this game-changing book, Kim and Mauborgne present a proven analytical framework and the tools for successfully creating and capturing blue oceans. blueoceanstrategy.comImpact PlaybookThis practical, no-nonsense guide was created specifically for use by social issue media makers, and contains a wealth of best practices for developing your engagement strategies and measuring and communicating the impact of your work. Download bavc.orgLean Analytics by Eric Ries, &#8211; The lean seriesThis book shows you how to validate your initial idea, find the right customers, decide what to build, how to monetize your business, and how to spread the word. Packed with more than thirty case studies and insights from over a hundred business experts, Lean Analytics provides you with hard-won, real-world information no entrepreneur can afford to go without.It looks at dozens of metrics—such as churn, customer lifetime value, viral coefficient, acquisition cost, uptime, and engagement—and suggests where that metric should be before you can move on to the next stage of your business. theleanstartup.com ↑↓Reports. Summarizing research.ideaBOOST Audience Engagement ReportAudience engagement models are a key part of this new production revolution. ideaBOOST: Audience Engagement Report, is the result of a research partnership between the CMF and the Canadian Film Centre’s Media Lab and their ideaBOOST accelerator program.Using case studies and a cross-case analysis of seven teams who were part of the first cohort of the ideaBOOST accelerator program, this insightful document equips content producers with knowledge about the different types of audience engagement, the techniques used to develop and interact with audiences and how audience engagement methods can be used at different stages of development and production processes, and to what effect. DownloadOntario’s Creative Cluster: Growing Faster than the Rest of the EconomyThe global entertainment and media market was estimated to be worth more than US$1.35 trillion in 2008, and is forecast to grow to approximately US$1.6 trillion by 2013.1 Creative industries now represent a significant proportion of many countries’ GDPs, as economies around the world recognize the importance of the creative industries to their future economic growth. As the “knowledge” versus “industrial” economy continues to grow in importance across all developed and developing countries, creative industries are critical to the larger knowledge economy job creation engine, preparing workers for a digital future that relies on creativity versus physical work. DownloadCrowdfunding in a Canadian ContextCrowdfunding is an emerging alternative financing vehicle that has experienced a recent boom in Europe and North America, primarily driven by recent multi-million dollar record-breaking successes on platforms in the US. In the wake of the increased media attention for these campaigns and recent changes to securities laws in the US to accommodate crowdfunding, this financing model has become more visible in Canada as well. A number of Canadian-based crowdfunding platforms have emerged and discussion has been abundant among regulatory and industry bodies—from the tech sector to the creative media sector—regarding how crowdfunding fits into Canada’s current legal, regulatory and funding environment.The Canada Media Fund (CMF) commissioned Nordicity to conduct a study on the topic of crowdfunding in Canada with a mandate to provide both an overview of the global crowdfunding phenomenon as related to the creative content industries and also a domestic environmental scan to determine what the demand for crowdfunding might be among content creators, how they might best leverage this type of funding and how it might fit into the broader structural environment for the creative content industries in Canada. DownloadTaking Ontario MobileTaking Ontario Mobile examines the benefits of mobile technologies for Ontarians as they work, learn, play, shop, seek care and interact with others. The report considers the disruptive nature of technologies and provides guidance and support for implementing mobile solutions, in order to enhance services for Ontarians as well as to improve their access to them. DownloadMobile Innovation: Ontario’s Growing Mobile Content, Services, and Applications Industry 2012This study was undertaken by the Mobile Experience Innovation Center (MEIC) to examine the tremendous amount of economic, technological, and cultural growth that has occurred in the mobile market in Ontario since 2007. The study profiles the current mobile ecosystem, assesses the economic impact of the industry, identifies emerging key trends in mobile, outlines potential market opportunities for the industry, and develops a collaborative framework to support the continued growth of mobile in Ontario. This study updates a previous MEIC study entitled Innovation and Insight: Mapping Ontario’s Mobile Industry (2009), which was supported by the Entertainment and Creative Cluster Partnerships Fund. November 22, 2012. Download"},{"title":"RSVP","date":"2016-06-15T22:54:12.000Z","updated":"2016-06-16T02:08:16.000Z","comments":true,"path":"rsvp/index.html","permalink":"http://www.astoundinitiative.ca/rsvp/index.html","excerpt":"","text":"Loading…"},{"title":"RSVP-BMC","date":"2016-06-15T22:54:15.000Z","updated":"2016-06-16T02:09:37.000Z","comments":true,"path":"rsvp-bmc/index.html","permalink":"http://www.astoundinitiative.ca/rsvp-bmc/index.html","excerpt":"","text":"Loading…"},{"title":"Who We Are","date":"2016-06-15T22:54:07.000Z","updated":"2016-06-16T01:12:02.000Z","comments":true,"path":"who_we_are/index.html","permalink":"http://www.astoundinitiative.ca/who_we_are/index.html","excerpt":"","text":"↑↓Programming Committee. Leading the pack.Slawko KlymkiwChief Executive OfficerCanadian Film CentreAna SerranoChief Digital OfficerCanadian Film CentreOrla GarriquesProject ManagerASTOUND InitiativeSabrina BulleyAssistantASTOUND InitiativeBrett HendrieManaging DirectorHot DocsASTOUND SALONElizabeth RadshawIndustry Programs DirectorsHot DocsASTOUND SALONChloe Sosa-SimsIndustry ProgrammerHot DocsASTOUND SALONJanelle ZhaoIndustry Programs AssistantHot DocsASTOUND SALONTom BarkerFounding Chair, Digital Futures Initiative (DFI)Graduates Program DirectorHelmut ReichenbacherMonica ContrerasASTOUND SUMMITSuzanne SteinASTOUND SUMMIT ↑↓Consortium. Working together.Tom BarkerOCADuMonica ContrerasOCADuOrla GarriquesASTOUND InitiativeMark GreenspanAchilles MediaDonald HendersonInteractive OntarioElizabeth RadshawHot DocsHelmut ReichenbacherOCADuRenee RobinsonWomen In Film and Television- TorontoAna SerannoCanadian Film CentreShane SmithToronto International Film FestivalChloe Sosa-SimsHot DocsSuzanne SteinOCADuSusan VaasCanadian Media Production Association (CMPA)Heather WebbWomen In Film and Television- Toronto ↑↓Contributors. Shaping our future.Dee BalkissoonMary BarrollBarroll Law OfficesEric BlaisOCADuRay BrooksSocial Impact Angel InvestorSean BuckleyBuck ProductionsSabrina BulleyASTOUND InitiativeZan ChandlerZancomMediaPearl ChenNascent DigitalKarma LaboratoryShari CohenOntario Media Development CorporationPaul ConnorNetwork of Angel Organization-Ontario (NAO-O)Alex ContiniAlex Contini DesignAndrew FisherWesley Clover International CorpNathon GunnSocial Game UniverseJohn Kojohnko.caLalita KrishnaInSync MediaAnn Marie MaduriMaduri Laird PartnersCharles OfficerSugar Cane ProductionsMarva OllivierreDoeeye MediaGlenn ParadisClairwood Capital Management Inc.Phil SchmittSummerwood GroupJohn SchoalesOntario Ministry of Culture Tourism &amp; SportQasim VirjeeDesign GuruBryan WatsonEP Enterprises Inc./ NACOAaron Williamsonvis.uali.stJoyce WongJanelle ZhaoHot Docs"}],"posts":[]}